<a href="https://colab.research.google.com/github/mishraoct786/MachineLearning-/blob/main/heroku_model_deployment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt 
import sklearn

In [3]:
df =pd.read_csv('hiring.csv')

In [4]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [5]:
df.isnull().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [9]:
df['test_score(out of 10)'].fillna(df['test_score(out of 10)'].mean(),inplace=True)

In [11]:
df['experience'].fillna(0,inplace=True)

In [12]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0               8.000000                           9      50000
1          0               8.000000                           6      45000
2       five               6.000000                           7      60000
3        two              10.000000                          10      65000
4      seven               9.000000                           6      70000
5      three               7.000000                          10      62000
6        ten               7.857143                           7      72000
7     eleven               7.000000                           8      80000

In [23]:
def stringToNum(word):
  dict={'zero':0,'one':1,'five':5,'two' : 2,
        'seven':7, 'three': 3 , 'ten':10,'eleven':11,0:0}
  return dict[word]

In [24]:
df['experience']=df['experience'].apply(lambda  x: stringToNum(x))

In [25]:
x=df.iloc[:,:3]
y=df.iloc[:,-1]